---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BendPolylineInvalid
source: html/4be4b3af-4956-217f-7836-b22efba3b94f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BendPolylineInvalid Property

The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type.

## Syntax (C#)
```csharp
public static FailureDefinitionId BendPolylineInvalid { get; }
```